[net]
# Testing
batch=1
subdivisions=1
# Training
# batch=64
# subdivisions=2
width=416
height=416
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches = 500200
policy=steps
steps=400000,450000
scales=.1,.1

streams=1,2
channels=3,3

# 0
[convolutional@1]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

# 1
[maxpool@1]
size=2
stride=2

# 2
[dropout@1]
prob=0.1

# 3
[convolutional@1]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# 4
[maxpool@1]
size=2
stride=2

# 5
[dropout@1]
prob=0.1

# 6
[convolutional@1]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

# 7
[maxpool@1]
size=2
stride=2

# 8
[dropout@1]
prob=0.1

# 9
[convolutional@1]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

# 10
[maxpool@1]
size=2
stride=2

# 11
[dropout@1]
prob=0.1

# 12
[convolutional@1]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

# 13
[maxpool@1]
size=2
stride=2

# 14
[dropout@1]
prob=0.1

# 15
[convolutional@1]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

# 16
[maxpool@1]
size=2
stride=1

# 17
[dropout@1]
prob=0.1

# 18
[convolutional@1]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

# 19
[dropout@1]
prob=0.1

###########

# 20
[convolutional@1]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

# 21
[dropout@1]
prob=0.1

# 22
[convolutional@1]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

# 23
[dropout@1]
prob=0.1

# 0
[convolutional@2]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

# 1
[maxpool@2]
size=2
stride=2

# 2
[dropout@2]
prob=0.1

# 3
[convolutional@2]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# 4
[maxpool@2]
size=2
stride=2

# 5
[dropout@2]
prob=0.1

# 6
[convolutional@2]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

# 7
[maxpool@2]
size=2
stride=2

# 8
[dropout@2]
prob=0.1

# 9
[convolutional@2]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

# 10
[maxpool@2]
size=2
stride=2

# 11
[dropout@2]
prob=0.1

# 12
[convolutional@2]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

# 13
[maxpool@2]
size=2
stride=2

# 14
[dropout@2]
prob=0.1

# 15
[convolutional@2]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

# 16
[maxpool@2]
size=2
stride=1

# 17
[dropout@2]
prob=0.1

# 18
[convolutional@2]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

# 19
[dropout@2]
prob=0.1

###########

# 20
[convolutional@2]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

# 21
[dropout@2]
prob=0.1

# 22
[convolutional@2]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

# 23
[dropout@2]
prob=0.1

# 0
[route]
layers=23@1,23@2

# 1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

# 2
[dropout]
prob=0.1

# 3
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

# 4
[dropout]
prob=0.1

# 5
[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear

# 6
[yolo]
mask = 3,4,5
anchors = 10,14,  23,27,  37,58,  81,82,  135,169,  344,319
classes=1
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1

# 24
[route@1]
layers=-3

# 25
[convolutional@1]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# 26
[upsample@1]
stride=2

# 27
[route@1]
layers=-1,12

# 28
[dropout@1]
prob=0.1

# 29
[convolutional@1]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

# 30
[dropout@1]
prob=0.1

# 24
[route@2]
layers=-3

# 25
[convolutional@2]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# 26
[upsample@2]
stride=2

# 27
[route@2]
layers=-1,12

# 28
[dropout@2]
prob=0.1

# 29
[convolutional@2]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

# 30
[dropout@2]
prob=0.1

# 7
[route]
layers=30@1,30@2

# 8
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# 9
[dropout]
prob=0.1

# 10
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

# 11
[dropout]
prob=0.1

# 12
[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear

# 13
[yolo]
mask = 1,2,3
anchors = 10,14,  23,27,  37,58,  81,82,  135,169,  344,319
classes=1
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
